{
  "manual_version": "original",
  "extracted_at": "2026-02-15T10:00:00Z",
  "source": "eR User Manual - July 2025",
  "total_pages": 209,
  "total_sections": 30,
  "sections": [
    {
      "id": "introduction",
      "title": "Introduction",
      "part": "Preamble",
      "page_range": "5",
      "content": "The purpose of this user manual is to provide an overview of the main functions and features of the eRegistrations system and to explain how to create online services.\n\nDescription of eRegistrations:\n- eRegistrations is a no-code development platform allowing to create online services without programming.\n- An online service is a succession of online screens and actions through which:\n  - an applicant can fill a form, upload documents, pay and send his request (application file)\n  - one or more operators can review the file and approve or reject an application (processing)\n  - The applicant data is sent to an online registry\n  - A registration certificate is issued\n- Online services are visible on the 'public site', also called 'user site' or 'DS' (Display System)\n- They are created through an 'administrative site', also called 'BPA' (Business Process Analyzer)",
      "subsections": ["Description of eRegistrations"],
      "screenshot_count": 1,
      "screenshot_descriptions": ["System architecture diagram"],
      "word_count": 120
    },
    {
      "id": "bpa-entry-page",
      "title": "A. Description of the entry page",
      "part": "I. BPA",
      "page_range": "6-9",
      "content": "The administrative site, also called BPA (Business Process Analyzer) is the site where online services are created. The BPA requires no programming. Services are built by configuring a succession of screens.\n\nThe BPA entry page has 3 main sections:\n- 'Header' also called 'instance bar' (the blue bar at the top)\n- Side menu (on the left)\n- Work space (in grey)\n\n1 The header or 'instance bar'\nIt consists sequentially of:\n- UNCTAD and eRegistrations logo\n- 3 buttons FE (front end), BE (back end) and DS (display system). When they are red, it means the corresponding component is getting updated. We can work on the system only when all buttons are green. When you put the cursor over the components name you will see the version number currently running. Versioning is made according to semantic versioning rules.\n- 'Logged users' show the number of administrators logged into BPA at that moment.\n- When the toggle is switched on, new feature/bug fixes are allowed to come automatically to the applications in the system\n- User level 1 and 2 is a toggle button that minimizes and expands display of elements on the side menu bar\n- User ID of the administrator logged in\n- Choice of language\n- Instance settings icon: 1. Settings that will apply to all services, 2. Translations icon, 3. Log-out icon\n\n2 Side menu\nThis view is accessible only after you have created and entered a service.\n- User level 1: Displays only a limited number of elements on the left side menu\n- User level 2: Displays more elements, including Tables and Certificate builder\n\n3 Work space\nThis is the gray area which displays the contents of the elements on the side bar, and where services are built.",
      "subsections": ["1 The header or 'instance bar'", "2 Side menu", "3 Work space"],
      "screenshot_count": 8,
      "screenshot_descriptions": ["BPA entry page overview", "Instance bar components", "FE/BE/DS status buttons", "User level toggle", "Instance settings", "Side menu user level 1", "Side menu user level 2", "Work space area"],
      "word_count": 250
    },
    {
      "id": "bpa-services",
      "title": "B. Services",
      "part": "I. BPA",
      "page_range": "10-13",
      "content": "A service is a succession of screens allowing the applicant to obtain one or more registrations.\n\nA registration is any authorization (certificate, permit, clearance, document) issued by a government agency that an applicant wants to obtain.\n\n1. Create a service\nA new service can be created by clicking on the 'add' button.\nThen a slider opens, where you can type the name of the service and click save.\nTo activate the service, click on the toggle next to the service name. Green indicates that the service is active. Inactive services will not be available on the public interface.\nAn inactive service can be archived in the system by clicking on the archive button.\nArchived services can be restored by clicking on 'archived services' and clicking on the unarchive button.\nA service can be removed from the system by clicking on the cross.\nOnce a service has been created, one or more registrations must be created and assigned to the service.\n\n2. The Service bar\nThis is the service bar, just below the instance (blue) bar. This appears when you click on a service from the list of services in the work space.\nThe service bar consists of:\n- The name of the service, that can be edited by clicking on the edit button next to it\n- The 'preview service' button: this displays the application file as seen from the user interface\n- The 'publish service' button: when a service is published, it becomes available on the public interface. Every time a change is made in the BPA that needs to be reflected on the public interface (DS), the service has to be (re)published.\n- The 'see service' button. This opens the service in the public interface (DS), in a new tab\n- Service settings icon",
      "subsections": ["1. Create a service", "2. The Service bar"],
      "screenshot_count": 8,
      "screenshot_descriptions": ["Services list page", "Add service button", "Service creation slider", "Service toggle activation", "Archive service button", "Archived services view", "Unarchive button", "Service bar components"],
      "word_count": 260
    },
    {
      "id": "bpa-registrations",
      "title": "C. Registration(s)",
      "part": "I. BPA",
      "page_range": "14-25",
      "content": "Registrations are at the core of the eRegistrations system. A registration is any type of authorization (license, permit, registration number, clearance, certificate, etc.) issued by a government institution, for which an applicant will usually need to provide data, documents and fee.\n\n1 Create a registration\nOnce a service has been created, one or more registrations must be created and assigned to the service. When you create a new registration, it will automatically be added to the service under which it has been created.\nClick on the 'add' button on the search bar. A slider opens. Enter registration name, enter short name (a short name is proposed automatically but you can modify it), create.\n\nA registration is defined by the following elements: a. Name, b. Result, c. Data required, d. Documents required, e. Fees, f. Institution in charge.\nThe 'Registrations' menu tab will allow us to define all elements except the 'data required', which will be defined in the application file tab, in the applicant form.\n\nResult: To add a result, click on '+ Select or add new' under Results. Then click on the 'add' button. A slider opens. Enter the result name (required), choose whether the result is physical or digital ('P' and 'D'), save. In case of digital result, a template can be built (see build certificates). To add an existing result, select from the drop down list.\n\nDocuments: To add documents required, click on '+ Select or add new' under Documents. A slider opens. Enter the document name, choose what is expected ('U' - must be uploaded, 'S' - must be shown at front desk, 'M' - must be signed at collection), save.\n\nFees: To add applicable fees, click on '+ Add new' under Fees. Fixed fees: Enter name, select 'fixed fee' under Fee Type, select currency, enter value, save. Formula fees: select 'Formula' in fee type, save, click on the fee to open it, click on 'click to add formula' under Formula. Drag and drop variables from left side, select arithmetic symbol, add.\n\nInstitution: To add the institution involved, click on '+ Select or add new' under Institutions. A slider opens. Enter name, enter URL, save. To add a Unit involved, click on 'Add new' under Involved Unit.\n\n2 Add registration(s) to a service\nTo add a new registration to a service, click on the service name. Click on the 'Add' button. A slider will open. Enter the name of the registration and click on 'Create'. To add an already created registration, click on 'add to service' from the 'all registrations' list.",
      "subsections": ["1 Create a registration", "2 Add registration(s) to a service"],
      "screenshot_count": 20,
      "screenshot_descriptions": ["Registration list page", "Add registration button", "Registration creation slider", "Registration elements", "Add result", "Result slider physical/digital", "Digital result template", "Select existing result", "Add documents", "Document slider U/S/M options", "Select existing document", "Add fees", "Fixed fee slider", "Formula fee type", "Formula builder drag and drop", "Add institution", "Institution slider", "Add unit", "Registration tabs", "Add registration to service"],
      "word_count": 380
    },
    {
      "id": "bpa-application-file",
      "title": "D. Application file",
      "part": "I. BPA",
      "page_range": "26-27",
      "content": "The application file:\n- It is composed of pages/screens through which the applicant will provide the required data, the documents and the fees.\n- In general, the application file is composed of the following pages:\n  - Guide: a page where the applicant has to answer questions that will allow the system to determine the registrations s/he needs to apply for and, according to the registrations selected, the required data, documents and fees.\n  - Form: to enter the required data\n  - Documents upload: to upload the required document\n  - Payment: a page explaining how and when the required fees can be made, or allowing to pay online\n  - Send: a page giving details about the processing of the file once submitted by the applicant\n- A very important notion, called 'determinant' is also explained. Determinants allow us to take into account the specific case of each applicant and, in particular, to generate an adapted applicant file format for each user.",
      "subsections": [],
      "screenshot_count": 2,
      "screenshot_descriptions": ["Application file overview", "Application file tabs"],
      "word_count": 150
    },
    {
      "id": "bpa-guide",
      "title": "D.1. The Guide",
      "part": "I. BPA",
      "page_range": "27-28",
      "content": "Questions can be created in the guide to help determine, for each specific user, which documents, fees and data are required.\nThe guide is defined by three elements: Description (name of the guide question), Form (where guide questions are developed and linked to the requirements and/or application form using determinants), Status.\n\nIf your service has a Guide, activate the guide toggle.\nTo create a question in the Guide, click on the 'Guide' tab in the Application File. Under the 'Form' tab, create questions using the form components that will filter the data, requirements and fees for specific users' case.\n\nAlternative to the guide: the shopping cart.",
      "subsections": [],
      "screenshot_count": 4,
      "screenshot_descriptions": ["Guide toggle activation", "Guide form tab", "Creating guide questions", "Shopping cart alternative"],
      "word_count": 110
    },
    {
      "id": "bpa-determinants",
      "title": "D.2. Determinants",
      "part": "I. BPA",
      "page_range": "28-31",
      "content": "A determinant is a filter allowing to take into account the particular case of each applicant in a service. It determines/triggers: if an applicant is subject to a registration and/or what requirements the applicant must provide to register (data, documents, fees).\n\n2.1. Determinants of the registration\nFor each registration, an analyst must be able to report/input in the rule engine, in clear language, rules defining who/what are the subjects of the registration. Options: 1) The registration is mandatory to all, 2) The registration is mandatory to specific subjects, 3) The registration is optional to all, 4) The registration is optional to specific subjects. Specific subjects can be defined through determinants or a combination of determinants combined by 'AND' and 'OR' operators.\n\n2.2. Determinants of the requirements\nDeterminants play a very important role in the application file. They allow to show or hide specific parts of the application form to adapt the form to the particular situation of each applicant. Determinants can be created on the basis of fields/questions in the Guide or in the form and can be applied to any field/block.\n\nTo create a determinant on a block, click on the edit button (gear icon). A slider will open. Click on the Determinant tab, Add. Insert name of determinant, choose 'Determinant based on field value' under determinant type, select the relevant field, choose the relevant predicate, select value or choose comparison field, save.\n\nOnce created, select and drop the determinant on the right panel under selected determinants, select the behavior of the component (show/hide when determinant condition is true), General Save.\n\nIf the field configuration has a determinant, it will be indicated by the letter 'D' in orange color. If there is more than one determinant, the icon will have a dot in the top right corner.\n\nSpecial cases of Determinants: Empty date field determinant - create a determinant with a selected date time field with predicate '=' or '!=' without selecting any date.",
      "subsections": ["2.1. Determinants of the registration", "2.2. Determinants of the requirements", "Special cases of Determinants"],
      "screenshot_count": 10,
      "screenshot_descriptions": ["Registration determinant options", "Determinant combination example", "Block edit button gear icon", "Determinant tab in slider", "Create determinant form", "Select determinant type", "Drag determinant to right panel", "Component behavior show/hide", "D indicator orange", "Multiple determinant dot indicator"],
      "word_count": 300
    },
    {
      "id": "bpa-applicant-form",
      "title": "D.3. Applicant form",
      "part": "I. BPA",
      "page_range": "32-42",
      "content": "This is the section in the application file where the applicant will provide the required data. The form can be developed and customized in any format based on an analysis of the data.\n\nTo create a form, drag and drop any type of required field component from the menu bar into the space below it.\n\nContainers menu consists of: Block, Table, Columns, Field set, Edit grid, Data grid, Tabs. Containers are mainly used to group/put together data that belong to the same class/category.\n\nBlocks separate/segregate the different types of information. Blocks are collapsible. If you do not want your blocks to collapse, disable the 'collapsible' toggle under the general tab.\n\nTable: drag and drop the table component inside the block. Indicate the number of rows and columns.\n\nColumns: will help align the fields. Only up to 12 units are fitted in one row (e.g., 6+6, 4+4+4, 3+3+3+3).\n\nField set: groups the fields of the same category of data together.\n\nEdit grid: enables replication of the same set of fields within it, and addition of multiple data for the same set of fields. The label can be hidden by activating 'Hide Label' toggle.\n\nData grid: very much like an edit grid.\n\nTabs: can make the form more organized. Can be displayed as a side menu (vertical layout). Structure can be nested.\n\nFields used while building the form: Catalog (drop-down menu), Sub Catalog, Button (various actions: event, custom, open link, open service and data in new tab).\n\nCommon properties: Help toggle (tooltips), Advanced toggle (additional features), Hide Label toggle, Placeholder, Tooltip, Prefix and Suffix, Disabled toggle, Hidden toggle, Reusable toggle, Listing value toggle, Allow Spellcheck, Searchable.",
      "subsections": ["Containers", "Fields", "Common properties"],
      "screenshot_count": 30,
      "screenshot_descriptions": ["Form builder overview", "Containers menu", "Block creation", "Block collapsible toggle", "Table component", "Columns component", "Field set", "Edit grid", "Data grid", "Tabs component", "Vertical tabs layout", "Nested tabs structure", "Catalog field", "Sub catalog", "Button component", "Button actions tab", "Button action event", "Button action custom", "Button action open link", "Button action open service", "Help toggle", "Advanced toggle", "Hide label toggle", "Placeholder example", "Tooltip example", "Prefix suffix", "Disabled toggle", "Reusable toggle", "Listing value toggle", "Searchable feature"],
      "word_count": 450
    },
    {
      "id": "bpa-documents",
      "title": "D.4. Documents",
      "part": "I. BPA",
      "page_range": "43",
      "content": "The Documents tab under Application File should be enabled if documents are defined under registration(s) of the service.\n\nIf there is a need for the required document to be visible in some other place on the form then the documents tab, there is a way to achieve it:\n1. Drag and drop a file upload component onto the desired form\n2. Open File upload component edit modal and go to the Data tab. Click on the 'Requirement' dropdown menu. You will be presented with the list of required documents assigned in service registration(s).\n3. Pick the required document from the list and click save. Link between the file upload component and the required document was created. Orange hint icon with L is visible in the top right corner.",
      "subsections": [],
      "screenshot_count": 4,
      "screenshot_descriptions": ["Documents tab toggle", "File upload component", "Requirement dropdown", "Linked document L icon"],
      "word_count": 130
    },
    {
      "id": "bpa-payment",
      "title": "D.5. Payment",
      "part": "I. BPA",
      "page_range": "44-45",
      "content": "If the service has fee(s) applicable (defined under registration(s)), the Payments tab needs to be enabled.\n\nTo add the payment component:\n- Click on the Form tab and create a hidden block with the Agency Code and Account Head ID components\n- Click on edit Agency Code. Under the Data tab, select agencyCode under Field Tags, Save\n- For Account Head ID, edit and select accountHeadId under Field Tags under the Data tab, Save\n- Under the Payments tab, drag and drop the Payment Providers component from the Custom components tab. Edit the title, Save.\n\nRadio buttons for online and manual payment will be automatically created inside the block.\n\nTo show decimals in costs, click on the service settings, under 'pages, buttons and field' tab, enable the toggle for 'Show decimals for costs'.",
      "subsections": [],
      "screenshot_count": 6,
      "screenshot_descriptions": ["Payments tab toggle", "Agency Code field", "Account Head ID field", "Payment Providers component", "Online/manual payment radios", "Show decimals toggle"],
      "word_count": 140
    },
    {
      "id": "bpa-send-file",
      "title": "D.6. Send file",
      "part": "I. BPA",
      "page_range": "46",
      "content": "This is the declaration and signature page. It can be developed the same way you develop the form.\n\nThe declaration can be created using the 'I Swear' component under Custom Components tab.",
      "subsections": [],
      "screenshot_count": 2,
      "screenshot_descriptions": ["Send file page", "I Swear component"],
      "word_count": 40
    },
    {
      "id": "bpa-useful-functions",
      "title": "D.7. Focus on some useful functions",
      "part": "I. BPA",
      "page_range": "47-63",
      "content": "a. Copy value of a field to another (prefilling a field)\nThis tool is useful because the applicant does not have to provide the same details repeatedly. To copy value from another field: Edit text field/number field, Data, under 'copy value from', choose the element from the drop down, Save. The order of elements is Name of the page, Block and Field. If the field configuration has the copy value setting, it will be indicated by the letter 'C' in blue color. CVF works only between fields of the same type.\n\nb. Copy edit grid values to another edit grid using copy value from\nTo set it up we need two edit grids - source and destination. In the destination edit grid, specify from which edit grid the data will be copied. You can also use a determinant in the destination edit grid copy value from tab.\n\nc. Field tags\nField tags are like bookmarks. We can put the same tag to various fields. It is used for concatenation of different fields. Listing-value: enables the name of the company under 'My Applications' on the user dashboard visible.\n\nd. Use formula with examples\nTypes of functions available in the formula builder: maxValue, round, Ceil, Floor, Roundup hundred/thousands/hundred thousands, Subtract days/months/years, Add days/months/years, Override year, Override date, Days difference, Weeks difference, Months difference, Years difference, Business days, Working hours, Working time, Penalty months, formatDateDD-MM-YYYY, Grid row counter, Extract Value From Grid.\n\nExamples: 1) Adding years to a date using addYears function. 2) Subtracting two dates using daysDifference function.\n\ne. Input mask\nUsed in text field component to auto validate characters. Input mask is under 'Validation' tab under 'Basic validation'. Use '9' for digits, 'A'/'a' for letters, '*' for alphanumeric. Multiple masks can be enabled.\n\nf. Blacklist\nUsed for restricting certain words in a text field. Click on Validation tab, click on Blacklist option. Options: Case sensitive, Exact match, Word match.\n\ng. Extract data from documents\nUsed to extract data from documents and putting them automatically onto the form. Under a registration, select the document, open edit modal, create model document, upload an example document. The data extractor lists data available for extraction.",
      "subsections": ["a. Copy value", "b. Copy edit grid values", "c. Field tags", "d. Use formula with examples", "e. Input mask", "f. Blacklist", "g. Extract data from documents"],
      "screenshot_count": 35,
      "screenshot_descriptions": ["Copy value from dropdown", "C indicator blue", "Edit grid copy value", "Determinant in copy value", "Field tags dropdown", "Listing value toggle", "Formula builder page", "Add formula button", "Function dropdown", "maxValue function", "round function", "Days difference function", "Add years example", "Formula page with fields", "F indicator", "Input mask validation tab", "Mask 9 for digits", "Multiple masks toggle", "Blacklist validation", "Add blacklist word", "Case sensitive/exact/word match", "Extract data document model", "Upload example document", "Data extractor list", "Copy value from extracted data"],
      "word_count": 650
    },
    {
      "id": "bpa-custom-classes",
      "title": "D.8. Custom classes",
      "part": "I. BPA",
      "page_range": "64-77",
      "content": "Custom class is a feature that can be applied to the fields in the forms. It is used for customizing fields (spacing, alignment, color, size, etc.) or to deploy a function to a particular field.\n\n1. Appearance changing classes: Value like label, Field + Button, Hide, Text right, Align value to right, Highlight block, Background (Blue/Gray/Green/Orange/Red), Fill background, Default notice, Radio Switch, Search results list.\n\n2. Spacing and alignment classes: Remove top space, Space top (label space), Top space/2X/3X, Remove top inner space, Vertical align top/center/bottom, Full height.\n\n3. Datagrid related classes: Datagrid footer, Add/Remove disabled, Datagrid Condensed, Has footer, Width, Datagrid Hide Column Label.\n\n4. Custom classes for Button: Field + Button, Orange/Blue/Green/Red, Disable on success, Show cog during form submit, Light color, Outline button.\n\n5. Custom classes used for certificate layout:\nOld certificate styles: Print-big-field, Print-small-field, (Print) Highlight Value, (Print) Certificate, (Print) Document Section, (Print) Documents last section, (Print) Terms and conditions, (Print) Certificate header, (Print) Certificate document title, (Print) Certificate footer.\nNew certificate styles: Print Page A4, Print text center/right/left, Print center vertical, Print Page top/bottom/horizontal margin small/medium/large, Print corner top/bottom left/right, Print watermark, Print footer distance small/medium/large, Print non latin text, Print color light/dark/brand, Print space xsmall/small/medium/large/xlarge, Print value small/large, Print label small/large.\n\n6. Other custom classes: Payment form component, I-swear component.",
      "subsections": ["1. Appearance changing classes", "2. Spacing and alignment classes", "3. Datagrid related classes", "4. Custom classes for Button", "5. Custom classes used for certificate layout", "6. Other custom classes"],
      "screenshot_count": 25,
      "screenshot_descriptions": ["Custom class dropdown", "Value like label example", "Field + Button example", "Text right example", "Highlight block example", "Background colors", "Default notice example", "Radio Switch example", "Search results list example", "Remove top space", "Space top label space", "Vertical align", "Datagrid footer example", "Width custom class", "Button color classes", "Outline button example", "Certificate old styles", "Print Page A4", "Print margins", "Print corners", "Print watermark", "Print colors", "Print spacing", "Compatibility matrix table", "Custom class selection"],
      "word_count": 500
    },
    {
      "id": "bpa-bot-builder",
      "title": "E. BOT builder",
      "part": "I. BPA",
      "page_range": "77-96",
      "content": "A BOT is an automated action performed by the system. There are two types of BOTs:\n- data BOT: to exchange data between an eRegistration service and an external system (eg a GDB database)\n- document BOT: to display a document on the screen or upload it to the user file. Two types: Display and Upload.\n\n1. Create a BOT\na) Document BOT: Click on BOT Builder tab, click 'add', enter BOT name, select 'Document BOT' under Type. Select category: 'generate and display', 'generate and upload', or 'generate upload display'. Select document. Only one document can be generated under one button.\n\nb) Data BOT: Select 'Data BOT' under Type. Select 'Create' under Categories.\n\nc) Internal BOT: enables the analyst to copy data from one component to another. Can be performed within the same form, between different forms, between grid components, or between forms in different services. Select 'Internal BOT' under Type.\n\nLinking services with internal BOT: Configure an internal BOT to paste data from current service form to another form in a different service. Change the receiving service in the mapping page.\n\nd) Adding actions (BOT roles) to the form\nThree ways to add BOT roles: 1. To a button, 2. To an input field, 3. To a block.\n\nBOT applied to button: Drag block, add table, add button. Click Actions, click 'click to add BOT', drag and drop action. Data and/or Document bots can be executed either in sequence or concurrently.\n\nBOT applied to field: Action applied to a field will be executed after 1.5 seconds from occurrence of last change.\n\nBOT applied to block: Action applied to a block will be executed after the block is rendered on the form.\n\n2. Mapping\nMapping is the process of matching fields from one database to another.\n\na) Mapping between eRegistrations and GDB: Select the database from GDB with the correct version. Create map links by clicking on data on eRegistrations database then clicking on same data in GDB. Field types should match.\n\nb) Mapping in internal BOTs: Map data between forms in the same service.\n\nc) Mapping transformations: Logic conditions applied to mapping. Transformations include: Equals value without case-sensitive, Not equals value, Contains value, Less than value, Greater than value, Starts with, Similarity, Fuzzy, Regex expression, Nullable, Not nullable, IN.",
      "subsections": ["1. Create a BOT", "d) Adding actions (BOT roles)", "2. Mapping"],
      "screenshot_count": 40,
      "screenshot_descriptions": ["BOT Builder tab", "Add BOT button", "Document BOT creation", "BOT categories dropdown", "Data BOT creation", "Internal BOT creation", "Internal BOT mapping", "Linking services mapping", "BOT applied to button setup", "Action drag and drop", "Concurrent toggle", "BOT applied to field", "BOT applied to block", "Mapping page overview", "eRegistrations-GDB mapping", "Blue arrow connections", "Field type mismatch indicator", "Eye icon hide fields", "Version selection dropdown", "Internal BOT mapping page", "Mapping transformation circle", "Transformation selection popup", "Violet circle indicator", "Equals without case example", "Contains value example", "Similarity transformation", "Fuzzy transformation", "Mapping transformations table"],
      "word_count": 600
    },
    {
      "id": "bpa-roles",
      "title": "F. Roles",
      "part": "I. BPA",
      "page_range": "97-116",
      "content": "A role is a necessary action by a public institution for a registration to be processed.\nThere are 2 types of roles:\n- Human role: a person will review the file, add some information, and approve, reject or send back the file.\n- BOT role: an automatic processing role performed by a BOT in the system.\n\n1. Create human roles\nClick on Processing (Roles) tab, click 'add'. 'Human role' is selected by default. Activate 'Is start role in process flow' if it is the first role. Select Role Type, Activate 'Visible for applicant', enter name and short name, create.\n\nA human role is defined by 3 elements:\na. Description: name of the role, institution in charge, registrations linked\nb. Form: describes the action that will take place\nc. Status: 0=pending, 1=passed successfully, 2=send back for correction, 3=rejected. Under statuses 1 and 2, must indicate destination role.\n\nMessages at various stages: Create messages using moustache template syntax. Messages can include rejection-reasons, file-rejected mustache variables. Links can be added to messages.\n\n2. Create BOT roles\nClick 'BOT role'. Activate 'Is start role in process flow' if first role. Select preceding role. Under BOT tab, select the BOT created for the role. Mapping enables data flow to/from eRegistrations and GDB.\n\n2.1 Polling BOT: Configure a BOT role to query the database periodically for a set amount of time. Toggle 'roles repeat until successful'. Set query interval and active duration.\n\n3. Description of various categories of human roles\na. Revision role: obliges the operator to verify and validate documents and data before sending to next role. Documents revision and data revision tabs. Field-by-field verification can be enabled in service settings.",
      "subsections": ["1. Create human roles", "2. Create BOT roles", "2.1 Polling BOT", "3. Description of various categories"],
      "screenshot_count": 35,
      "screenshot_descriptions": ["Processing Roles tab", "Add role slider", "Human role options", "Role type selection", "Role description tab", "Add registrations to role", "Add institution to role", "Role form tab", "Status configuration", "Message creation", "Moustache template", "Rejection reasons mustache", "Link in message", "Message receiver setup", "Delays configuration", "BOT role creation", "BOT tab configuration", "API version selection", "Polling BOT toggle", "Interval and duration settings", "Revision role overview", "Documents revision tab", "Document rejection reason", "Data revision tab", "Revision by field toggle", "Field validation in Part B", "Approval button activation"],
      "word_count": 550
    },
    {
      "id": "bpa-certificates",
      "title": "G. Certificates",
      "part": "I. BPA",
      "page_range": "117-124",
      "content": "1. Build certificates\nTemplates/certificates for electronic results can be built in two ways:\n1) Through certificate builder on the left hand side bar of user level 2: Click on 'Certificate' on the side menu, click 'Add', enter name, create. Click on the certificate name to configure it. The form builder page will appear. Click on 'cert.form' tab to build the certificate.\n\n2) Through the registration: Choose the registration, click on 'Digital result' (green button). Activate the digital result button. Scroll down and click on 'create template'. Enter name.\n\nThe certificate form can be built just like the application form. Values for text fields can be copied from the application file or processing role through edit text field, data, copy value from. Value of expiration date can be fixed from the 'data' tab.\n\n2. Add QR Code\nThe QR technology merges the physical world with the digital world. Signatures and other authentications are replaced by QR codes. They manifest the legitimacy of a document.\n\nTo add QR code on a template, drag and drop the 'QR code' from the Custom Component tab on the template.",
      "subsections": ["1. Build certificates", "2. Add QR Code"],
      "screenshot_count": 15,
      "screenshot_descriptions": ["Certificate builder side menu", "Add certificate button", "Certificate creation slider", "Certificate list", "Certificate form builder", "Certificate through registration", "Digital result button", "Create template button", "Certificate form building", "Copy value from for certificate", "Expiration date data tab", "QR code component", "QR code on template", "Certificate preview"],
      "word_count": 210
    },
    {
      "id": "bpa-tables",
      "title": "H. Tables",
      "part": "I. BPA",
      "page_range": "125-132",
      "content": "Tables is a list of catalogs in the system. There are three types of tables/catalogs:\n1. Service catalogs (or simply tables)\n2. Cross-tables\n3. Instance catalogs\n\nService catalogs and cross-tables show data of elements related to only one service. Instance catalogs show catalogs of elements that can be applied to all services in one instance.\n\n1. Tables/Service catalogs: they group by nature all the elements created in the services (data fields, fees, documents, institutions, units, determinants, questions, etc.). The number within brackets indicates the number of elements available.\n\n2. Cross-tables: a way to see elements linked to each registration (data/registrations, documents/registrations, fees/registrations, roles/registration, etc.).\n\n3. Instance catalogs: Catalogs used by all services in one instance (list of countries, cities, company types, economic activities, etc.).\n\na) How to create a catalog: Click 'add', type name, click 'create'. Add values by typing and clicking 'Add'. Up to 500 characters per value. Sub catalogs can be created by clicking the select button next to items. GDB based catalogs can also be created.\n\nb) How to import a catalog with subcatalogs and/or multiple translations: Upload items modal allows downloading templates and importing modified files.\n\nGroups: Created in catalogs with many items. Groups can be used as determinants.\n\nc) Document rejection reasons: Create/add reasons for rejection in operators' processing page.",
      "subsections": ["1. Tables/Service catalogs", "2. Cross-tables", "3. Instance catalogs", "Groups", "Document rejection reasons"],
      "screenshot_count": 15,
      "screenshot_descriptions": ["Tables overview page", "Service catalogs list", "Catalog elements count", "Cross-tables view", "Fees cross-table example", "Instance catalogs page", "Create catalog button", "Add catalog value", "Sub catalog selection", "GDB based catalog", "Import catalog modal", "Template download", "Groups creation", "Group toggle buttons", "Document rejection reasons"],
      "word_count": 300
    },
    {
      "id": "bpa-settings",
      "title": "I. Settings",
      "part": "I. BPA",
      "page_range": "133-137",
      "content": "1. Instance settings\nSettings made in instance settings will be applied to all services in that instance. The instance settings icon is at the end of the instance menu bar.\n\nInstance settings consist of three elements: Settings (logo, language options, currencies, footer messages, layout components), Translations, and Log out.\n\nOptions in display system: Registration link, Hide My documents tab, Hide My messages tab, Hide filter function, Hide service search function.\n\n2. Service settings\nSettings apply only to that particular service. The service settings icon is at the end of the service menu bar.\n\na) Pages, buttons and fields:\n- Blocks and fields: Option to make blocks/fields visible in Part A and Part B based on registration linkage\n- Buttons: Options to show print buttons on Guide and Part B, enabling BPA system buttons in Part B\n- Page: Options for page name, preview file, file type for required documents, revision by field, show data next to document revision, show decimals for costs\n- Application history, Old guide, Shopping cart, Formio version, UI theme\n\nb) Service Options\nc) Publish history\nd) Export service\ne) Databases",
      "subsections": ["1. Instance settings", "2. Service settings"],
      "screenshot_count": 12,
      "screenshot_descriptions": ["Instance settings icon", "Instance settings page", "Display system options", "Registration link toggle", "Service settings icon", "Pages buttons fields tab", "Blocks and fields options", "Buttons options", "Page options", "Formio version selector", "Service options tab", "Publish history"],
      "word_count": 220
    },
    {
      "id": "ds-user-dashboard",
      "title": "A. The user dashboard",
      "part": "II. DS",
      "page_range": "137-142",
      "content": "The user site or the Display System is the user dashboard.\n\n1. For new users\nThe header and menu bar consists of: The home button (national logo), home button, login button, register button.\n\nWhen the user clicks register, the create account page will be displayed. User provides information and clicks RegisterForAccount. Verification email will be sent.\n\nChoice of language. The home page displays all available online services.\n\n2. For logged in users\nMenu bar consists of: home button and My Account page, name of user, choice of language.\n\nThe Home button/My Account page displays: My Applications tab (list of applications saved/submitted), My Documents tab (documents submitted), My Messages tab (messages from administrations/processing roles).\n\nUnder My Applications: service name, business name, date started, date submitted, status, certificates (can be printed from dashboard).\n\nFilter: search for specific application by service or business name.\nApplication history: click on a service to see stages.\nApplication status shown by different colors. Status filters available at bottom.",
      "subsections": ["1. For new users", "2. For logged in users"],
      "screenshot_count": 20,
      "screenshot_descriptions": ["DS header and menu bar", "Home button", "Login button", "Register button", "Create account page", "Verification email", "Language choice", "Home page services list", "Logged in menu bar", "My Applications tab", "My Documents tab", "My Messages tab", "Applications table columns", "Certificate icon", "Filter function", "Application history view", "Status colors", "Status filters", "Services list below applications"],
      "word_count": 220
    },
    {
      "id": "ds-application-file",
      "title": "B. Application file (DS)",
      "part": "II. DS",
      "page_range": "143-144",
      "content": "1. Guide\nAnswers provided in the Guide will help determine, for each specific user, which documents, fees and data are required.\nShopping cart: Alternative to the Guide, improved version. Shows summary of registrations, how much to pay and what documents to upload. Accessible on all pages.\n\n2. Applicant form\nThis is where the applicant provides all the relevant data that pertains to his objective.\n\n3. Documents\nThis is the documents upload page. This tab will appear only if documents need to be uploaded.\n\n4. Payment\nPayment tab will appear only if there is a payment in the process.\n\n5. Send page\nThe confirmation page usually consists of a set of terms and conditions that the applicant needs to abide by.",
      "subsections": ["1. Guide", "2. Applicant form", "3. Documents", "4. Payment", "5. Send page"],
      "screenshot_count": 8,
      "screenshot_descriptions": ["Guide page in DS", "Shopping cart view", "Applicant form in DS", "Documents upload page", "Payment page", "Send page"],
      "word_count": 130
    },
    {
      "id": "ds-operators-processing",
      "title": "C. Operators processing pages",
      "part": "II. DS",
      "page_range": "145-151",
      "content": "Processing pages are what operators of the institutions which offer registrations in a service see. As a super administrator, you can access the operators' processing pages from the display system (through Part B).\n\n1. The file list page\nThe list of files filtered by status (pending, approved, rejected, sent back for corrections) is displayed. The drop down list displays all services. Select the service, then select the role from the first dropdown. Calendar icon allows viewing applications submitted at a certain day/time range. The first screen displays all pending files by default.\n\nSub menu: Status of file, Business name, Date of receipt, status of registrations, operator in charge. Status filter on bottom corner with different colors. Other filters: all files, validated, sent back, rejected.\n\n2. The processing page\nThis is the 2nd screen of the operator's role. The top part displays application details (zip folder of documents) and application history.\n\na) Revision role: Requires operator to verify documents and data. If operator chooses 'NO' under documents revision, field appears for rejection reason. Documents revision tab shows uploaded documents on left, data and requirements on right. Data revision tab displays all components.\n\nb) Processing role: Form/action developed by analyst. Operator can generate action (display/upload certificate). Validate, reject, or send back the application. Documents tab shows uploaded documents and certificates. Data tab shows all BPA application file components.\n\n3. Clearing old file from the service",
      "subsections": ["1. The file list page", "2. The processing page", "3. Clearing old file"],
      "screenshot_count": 20,
      "screenshot_descriptions": ["File list page overview", "Service dropdown", "Role dropdown", "Calendar filter", "Pending files list", "Status sub menu", "Status filter colors", "Status dropdown options", "Processing page top", "Application details zip", "Application history", "Revision role overview", "Document revision NO option", "Rejection reason field", "Documents and data side by side", "Data revision tab", "Approval button", "Processing role form", "Documents tab in processing", "Data tab in processing"],
      "word_count": 300
    },
    {
      "id": "gdb-public-part",
      "title": "A. Public part",
      "part": "III. GDB",
      "page_range": "153-154",
      "content": "GDB is a system to create and administer a professional database easily, without programming. Databases created with GDB can exchange data electronically with eRegistrations and any other external system through Web services.\n\nGDB is composed of a public part (where we see the databases created and their content) and an admin part.\n\nThe header bar consists of: Hamburger button (displays list of databases, 'create new database' and 'create new group' buttons), Name of database currently displayed, Status button (version and last updated date), Language, Logged in user.\n\nThe sub menu displays the name of the database. The 'add record' button and edit/delete icons are visible only to authorized users.",
      "subsections": [],
      "screenshot_count": 6,
      "screenshot_descriptions": ["GDB public page overview", "Header bar components", "Hamburger menu", "Database list", "Sub menu", "Record view"],
      "word_count": 130
    },
    {
      "id": "gdb-create-database",
      "title": "B.1. Create a database",
      "part": "III. GDB",
      "page_range": "155-157",
      "content": "To create a database, click on the hamburger button, then click 'create new database'. Enter institution name under Title, enter short name (without spaces). Version starts at 1.0.\n\nCreate the DB structure adding fields and blocks by clicking on the '+' symbol. 'ID' appears by default as the first field. Click on the dropdown to select field type (text, number, block, date, catalog, etc.). Note: field type should be same as in BPA.\n\nUse blocks to group records/fields together. Click 'simple view' to view basic components. Use the symbol in front to change order by dragging. Publish to save and see changes in public part.",
      "subsections": [],
      "screenshot_count": 8,
      "screenshot_descriptions": ["Hamburger button", "Create new database button", "Database title and short name", "DB structure with + button", "Field type dropdown", "Blocks in structure", "Simple view toggle", "Publish button"],
      "word_count": 120
    },
    {
      "id": "gdb-database-groups",
      "title": "B.2. Database groups",
      "part": "III. GDB",
      "page_range": "158-162",
      "content": "To create a database group, click hamburger button, then 'create new group'. Enter name, optionally upload a logo. Databases can be created within groups or dragged into groups.\n\na) Edit Group\nb) Database diagram: Visualization of how different databases within the same group relate to each other. Click on group name then diagram icon. All databases shown as blocks with relationship lines. Zoom with mouse scroll, rearrange with drag and drop. Navigation icons for layout.\n\nc) Creating a link between databases: Click DB structure, click Settings for a field, switch toggle 'Link to other DBs' on, select database and field to link. 'L' icon indicates linked field.",
      "subsections": ["a) Edit Group", "b) Database diagram", "c) Creating a link between databases"],
      "screenshot_count": 12,
      "screenshot_descriptions": ["Create new group button", "Group name and logo", "Database diagram icon", "Diagram visualization", "Zoom and navigation", "Collapsed/expanded blocks", "Block vs list title colors", "DB structure button", "Field settings", "Link to other DBs toggle", "L icon indicator", "Linked database diagram"],
      "word_count": 140
    },
    {
      "id": "gdb-add-record",
      "title": "B.3. Add record",
      "part": "III. GDB",
      "page_range": "163-165",
      "content": "To add a record, click 'Add record' button on sub menu. A slider opens. Enter all data, Save. The slider can be expanded or minimized by dragging the border. Records can be edited or deleted.\n\nField history: Click on a record to see details. History icon appears next to every field. Shows date of change, user who made change, type of action, initial value, new value. Block container history shows times table for tracing value changes by date.",
      "subsections": ["Field history"],
      "screenshot_count": 8,
      "screenshot_descriptions": ["Add record button", "Record entry slider", "Expandable slider", "Edit/delete record", "Field history icon", "Field history window", "Container history", "Times table changes"],
      "word_count": 100
    },
    {
      "id": "gdb-management",
      "title": "B.4. Database management section",
      "part": "III. GDB",
      "page_range": "164-174",
      "content": "The 'tools on' button displays the database management menu: Version, creation date, administrator login. Filters allow selective data viewing. Complex filters available for nested conditions. Columns tab displays selected data. Reports tab for creating/viewing reports. Import data from external files/databases. Export data in JSON, XLS, CSV formats. Log displays change history. Delete data button (irreversible).\n\na) Views: Subset of GDB displaying selected data defined by filters. Create view by clicking Views tab, '+' button, enter name, add filters, drag fields to 'view fields'. Publish for visibility. Complex views involving multiple databases possible through linked databases.\n\nb) APIs: Tool for web services enabling data exchange between DS and GDB. API types: Create, Create-entries, Read, List, Update, Listen, Update-entries, Exists, Delete. Dashboard shows creation date, name, URL, usage counts. APIs versioned per database version. Visibility toggle controls BPA availability.\n\nc) DB Structure: Modify database structure. Duplicate database. Add/delete/reorder fields. Version updates on save. Publish and remap in BPA required.",
      "subsections": ["Filters", "a) Views", "b) APIs", "c) DB Structure"],
      "screenshot_count": 30,
      "screenshot_descriptions": ["Tools on button", "Management menu", "Filters tab", "Filter configuration", "Complex filters", "Columns tab", "Reports tab", "Import data", "Export data formats", "Log view", "Delete data button", "Views tab", "Create view form", "View filters", "Drag fields to view", "Published view", "View URL/embed options", "Complex view multiple databases", "APIs dashboard", "Create New API button", "API version selector", "Dashboard header filters", "API table content", "Statistics visualization", "Copy URL button", "Visibility toggle", "Delete API button", "DB Structure slider", "Duplicate button", "Version update"],
      "word_count": 350
    },
    {
      "id": "gdb-special-features",
      "title": "B.5. Special features",
      "part": "III. GDB",
      "page_range": "175-182",
      "content": "a) To change format of ID: Click DB Structure, click settings cog on ID column. Advanced Settings, Triggers tab. Configure with available tags: Short name, Index no, Index no by database code, Current year, End of number current year.\n\nb) Show catalog key in the database structure: Click Settings, activate 'Show key and value' toggle.\n\nc) Migrate data between databases: Open target table, click 'Import Data', Database tab, Create. Select source database, drag and drop column labels to map data, click Migrate.\n\nd) Import data to other database on trigger.\n\ne) Setting readonly field property on GDB.\n\nf) How to apply pattern label (regex using) on GDB.\n\ng) How to add listing value in GDB edit grids.\n\nh) How to compare two databases.\n\ni) How to make a textfield into a select predefined values field.\n\nj) Where to limit the document type accepted by the file field.\n\nk) How to configure database file field to accept multiple files: Open DB structure, add file field, open advance settings, Base settings tab, activate Multiple toggle, publish.",
      "subsections": ["a) Change ID format", "b) Show catalog key", "c) Migrate data", "d) Import on trigger", "e) Readonly field", "f) Pattern label", "g) Listing value in edit grids", "h) Compare databases", "i) Textfield to select", "j) Limit document type", "k) Multiple files"],
      "screenshot_count": 15,
      "screenshot_descriptions": ["DB Structure settings cog", "Advanced Settings Triggers tab", "ID tags configuration", "Short name tag example", "Index no example", "Catalog key toggle", "Key and value display", "Import Data dialog", "Source database selection", "Column mapping drag and drop", "Migrate button", "Readonly toggle", "Pattern label setting", "Multiple toggle", "File field configuration"],
      "word_count": 250
    },
    {
      "id": "gdb-user-rights",
      "title": "B.6. User rights in GDB",
      "part": "III. GDB",
      "page_range": "183-188",
      "content": "User rights management enables admin users to grant or take away rights and privileges to other users.\n\na) Introduction to user rights page: Click user button, select User management. Left side: list of registered users. Right side: rights granted to selected user.\n\nSearch an existing user or import new user from CAS or Keycloak.\n\nCreate a new user: Must be registered in CAS/KC first. Import by clicking icon next to search field, enter user ID.\n\nRight side: rights - Resources (databases) in first column. Actions: Read, Create, Update, Publish, Delete, User rights. Toggles define actions per database.\n\nGroups of databases: Listed under their group. Rights can be granted to group or specific database.\n\nb) Granting right to Database structure: Read (needs Data toggle on), Update (Save button appears), Publish (Publish button appears), Delete (Delete button appears).\n\nc) Data User rights (Generic): Read, Update (Edit button per entry), Delete (Delete button per entry).\n\nd) Data User rights (field level restrictions): Click 'restrictions' button. Grant read/update rights to specific columns or records matching filter conditions.\n\ne) General rules for actions toggle behavior: GREEN=fully authorised, GREY=not authorised, YELLOW=partially authorised. Parent GREEN=all children GREEN. Parent YELLOW=at least one child YELLOW or GREY. Parent GREY=all children GREY.",
      "subsections": ["a) Introduction to user rights page", "b) Granting right to Database structure", "c) Data User rights (Generic)", "d) Data User rights (field level restrictions)", "e) General rules for actions toggle behavior"],
      "screenshot_count": 18,
      "screenshot_descriptions": ["User management button", "User rights page overview", "Search user field", "Import user from CAS", "Rights columns table", "Toggle actions per database", "Groups in user rights", "Database structure Read toggle", "Update toggle Save button", "Publish toggle button", "Delete toggle button", "Data Read toggle", "Edit button per entry", "Delete button per entry", "Restrictions button", "Field level restrictions window", "Records filter setup", "GREEN/GREY/YELLOW toggle rules"],
      "word_count": 300
    },
    {
      "id": "statistics-overview",
      "title": "A. Overview",
      "part": "IV. Statistics",
      "page_range": "189",
      "content": "Statistics module is a tool for registered users to see statistical information about files and processes in eRegistrations system. It can also present KPI (Key Performance Indicators) for managers.\n\nPanel at top enables switching between types of statistics, changing language or logging out. Every type of statistics has its own set of filters and tools.",
      "subsections": [],
      "screenshot_count": 3,
      "screenshot_descriptions": ["Statistics entry view", "Top panel navigation", "Statistics types menu"],
      "word_count": 60
    },
    {
      "id": "statistics-types",
      "title": "B. Types of statistics",
      "part": "IV. Statistics",
      "page_range": "190-193",
      "content": "1. Roles\nPurpose: provide information about the number of files that obtained a specific status in a given service role for a defined period of time.\nFilters: Filter empty rows, Show inactive services, Date field (calendar for period selection), Service filter, Registration filter, Status filter. Data can be broken down into days/weeks/months/years. Export to excel or PDF.\n\n2. Certificates issued\nPurpose: provide information about the number of certificates generated for a given service within a period.\nFilters: Certificates filter (lists certificate across services).\n\n3. Operators\nPurpose: provide information on specific operator activity - number of files processed through a role, broken down into statuses (Processed, Approved, Sent back, Rejected).\nFilters: Operator filter (type-ahead input), Roles filter.\n\n4. Times per Role\nPurpose: information about how much time the file spent in a given role. Shows average, minimum and maximum time for processed files.\n\n5. Times per operator\nPurpose: how much time every operator spent processing files in a given role. Shows average, minimum and maximum time.\n\n6. Rejection reasons\nProvides rejection reasons for files processed and rejected or sent back for correction in Part B revision role. Filter by service name and Status (2-Sent back, 3-Rejected). Dashboard shows: rejection reason, status code, operator, role name, date of rejection.",
      "subsections": ["1. Roles", "2. Certificates issued", "3. Operators", "4. Times per Role", "5. Times per operator", "6. Rejection reasons"],
      "screenshot_count": 12,
      "screenshot_descriptions": ["Roles statistics view", "Roles filters panel", "Date calendar selector", "Service filter", "Status breakdown", "Export buttons", "Certificates issued view", "Operators statistics", "Operator filter", "Times per Role view", "Times per operator view", "Rejection reasons dashboard"],
      "word_count": 280
    }
  ]
}
