{
  "section_id": "smartlink",
  "title": "SmartLink",
  "analyzed_at": "2026-02-15T16:10:00Z",
  "change_summary": "Entirely new section. SmartLink is a feature for linking between services in eRegistrations, enabling data sharing and workflow coordination across multiple services within the same instance. The original manual documents Internal BOTs for cross-service data transfer (section E, BOT builder), but SmartLink appears to be a higher-level or complementary mechanism. The exact relationship to Internal BOTs, the UI configuration workflow, and the available linking options all need verification. The MCP tools include a serviceregistration_link endpoint suggesting service-registration linkage is part of the infrastructure. 6 blocks identified, mostly needing verification due to limited concrete information.",
  "change_count": 6,
  "blocks": [
    {
      "type": "verify",
      "title": "Overview of SmartLink",
      "content": "SmartLink is a feature in eRegistrations that enables linking between services, allowing data sharing and workflow coordination across multiple services within the same instance. When services are linked through SmartLink, data entered in one service can flow to another service, and workflow steps can be coordinated across service boundaries.\n\nSmartLink may extend or complement the Internal BOT functionality that already exists for cross-service data transfer (documented in the BOT builder section). While Internal BOTs copy data between specific form fields across services, SmartLink may provide a higher-level linkage mechanism that manages the overall relationship between services.",
      "original_content": null,
      "explanation": "SmartLink is identified as a new feature in the manual update plan. The MCP tools include a 'serviceregistration_link' endpoint that links services to registrations, which may be part of the SmartLink infrastructure. However, the exact scope and definition of 'SmartLink' as a user-facing feature needs verification. It is unclear whether SmartLink is a specific named feature in the BPA UI or an umbrella term for service-linking capabilities.",
      "screenshot_status": "unknown",
      "screenshot_description": "Screenshots of the SmartLink feature in the BPA, if it has a dedicated UI, or screenshots of how services are linked together."
    },
    {
      "type": "verify",
      "title": "SmartLink vs Internal BOT for Cross-Service Data Transfer",
      "content": "The original manual documents Internal BOTs (section E, BOT builder) as the mechanism for copying data between services. An Internal BOT can be configured to 'paste data from current service form to another form in a different service' by changing the receiving service in the mapping page.\n\nSmartLink may be:\n1. A separate, higher-level feature that manages service-to-service relationships, with Internal BOTs handling the actual data transfer.\n2. A replacement or evolution of the Internal BOT cross-service functionality.\n3. A UI layer on top of Internal BOTs that makes cross-service linking easier to configure.\n\nThe exact relationship between SmartLink and Internal BOTs needs to be verified.",
      "original_content": null,
      "explanation": "The original manual clearly documents Internal BOTs for cross-service data transfer. SmartLink is a newer feature whose relationship to Internal BOTs is not clear from the available information. A human reviewer should determine whether SmartLink replaces, extends, or is unrelated to Internal BOTs.",
      "screenshot_status": "unknown",
      "screenshot_description": "Side-by-side comparison of SmartLink configuration and Internal BOT cross-service mapping, if both exist."
    },
    {
      "type": "verify",
      "title": "Service-Registration Linking",
      "content": "The platform supports linking services to registrations through a dedicated mechanism. This allows a registration created under one service to be associated with or accessible from another service. This may be a component of the SmartLink feature or a separate capability.\n\nThe linking operation connects a service with a registration, enabling the registration's data, documents, and fees to be shared across service boundaries.",
      "original_content": null,
      "explanation": "The MCP tools include a 'serviceregistration_link' endpoint that takes a service_id and registration_id, suggesting that service-registration linking is a supported operation. However, it is not clear whether this is part of SmartLink or a general platform capability. The current manual documents adding registrations to services (section C) but does not mention linking registrations across services.",
      "screenshot_status": "unknown",
      "screenshot_description": "Screenshot of the service-registration linking interface, if distinct from the standard 'add registration to service' workflow."
    },
    {
      "type": "verify",
      "title": "SmartLink Configuration Workflow",
      "content": "The SmartLink configuration workflow likely involves:\n1. Navigating to the SmartLink configuration area (location in BPA to be verified).\n2. Selecting the source service and the target service to link.\n3. Defining what data or workflow elements are shared between the services.\n4. Configuring the direction of data flow (unidirectional or bidirectional).\n5. Optionally defining conditions under which the link is active.\n6. Saving and publishing the link configuration.\n\nThe exact steps, UI location, and available options need verification on the live platform.",
      "original_content": null,
      "explanation": "The configuration workflow is speculative based on the general concept of service linking. No MCP tool or existing documentation provides the specific UI steps. A human reviewer must document the actual workflow by accessing the BPA.",
      "screenshot_status": "unknown",
      "screenshot_description": "Step-by-step screenshots of the SmartLink configuration process in the BPA."
    },
    {
      "type": "verify",
      "title": "SmartLink Data Sharing Capabilities",
      "content": "SmartLink may enable sharing of the following types of data between linked services:\n- Applicant form data (personal information, company details, etc.)\n- Document uploads\n- Registration results and certificates\n- Application status and workflow state\n- Fee payment information\n\nThe exact types of data that can be shared and any restrictions on data sharing need verification.",
      "original_content": null,
      "explanation": "The data sharing capabilities are speculative based on what would be useful in a multi-service context. The actual capabilities may be more limited or more extensive. A human reviewer should verify what data types can be shared through SmartLink.",
      "screenshot_status": "unknown",
      "screenshot_description": "Screenshots showing the data sharing configuration options in SmartLink."
    },
    {
      "type": "verify",
      "title": "SmartLink UI Location in BPA",
      "content": "SmartLink may be accessible from one or more of the following locations in the BPA:\n- A dedicated 'SmartLink' tab or menu item in the side menu.\n- Within the service settings or service bar.\n- Through the registration configuration interface.\n- As part of the BOT builder interface.\n\nThe exact location and navigation path need to be verified on the live platform.",
      "original_content": null,
      "explanation": "Without access to the live BPA UI, the exact location of SmartLink cannot be determined. The MCP tools do not describe UI navigation. A human reviewer should identify where SmartLink is accessed in the BPA.",
      "screenshot_status": "unknown",
      "screenshot_description": "Screenshots showing where SmartLink appears in the BPA navigation and menus."
    }
  ]
}
